mentors = [
    ["Евгений Шмаргунов", "Олег Булыгин", "Дмитрий Демидов", "Кирилл Табельский", "Александр Ульянцев",
     "Александр Бардин", "Александр Иванов", "Антон Солонилин", "Максим Филипенко", "Елена Никитина",
     "Азамат Искаков",
     "Роман Гордиенко"],
    ["Филипп Воронов", "Анна Юшина", "Иван Бочаров", "Анатолий Корсаков", "Юрий Пеньков", "Илья Сухачев",
     "Иван Маркитан", "Ринат Бибиков", "Вадим Ерошевичев", "Тимур Сейсембаев", "Максим Батырев", "Никита Шумский",
     "Алексей Степанов", "Денис Коротков", "Антон Глушков", "Сергей Индюков", "Максим Воронцов", "Евгений Грязнов",
     "Константин Виролайнен", "Сергей Сердюк", "Павел Дерендяев"],
    ["Евгений Шмаргунов", "Олег Булыгин", "Александр Бардин", "Александр Иванов", "Кирилл Табельский",
     "Александр Ульянцев", "Роман Гордиенко", "Адилет Асканжоев", "Александр Шлейко", "Алена Батицкая",
     "Денис Ежков",
     "Владимир Чебукин", "Эдгар Нуруллин", "Евгений Шек", "Максим Филипенко", "Елена Никитина"],
    ["Владимир Чебукин", "Эдгар Нуруллин", "Евгений Шек", "Валерий Хаслер", "Татьяна Тен", "Александр Фитискин",
     "Александр Шлейко", "Алена Батицкая", "Александр Беспоясов", "Денис Ежков", "Николай Лопин", "Михаил Ларченко"]
]


codes_info = [
    "",
    "1 — число цели, которая проявляется в форме агрессивности и амбиций",
    "2 — число равновесия и контраста одновременно, поддерживает равновесие, смешивая позитивные и негативные качества",
    "3 — неустойчивость, объединяет талант и весёлость, символ приспосабливаемости",
    "4 — означает устойчивость и прочность",
    "5 — символизирует риск, свободу и душевное беспокойство, которое толкает человека к путешествиям и новому опыту. С одной стороны, это самое счастливое число, с другой — самое непредсказуемое",
    "6 — символ надёжности. Идеальное число, которое делится как на чётное, так и на нечётное, объединяя элементы каждого",
    "7 — символизирует тайну, а также изучение и знание как путь исследования неизвестного и невидимого",
    "8 — число материального успеха, означает надёжность, доведённую до совершенства, символ всеобщего успеха",
    "9 — указывает на сильную личность с потенциальным интеллектом, способную к высокому развитию"
]


# Здесь ничего менять не нужно, это готовый код, который считает число имени
def calc_namecode(name):
    letters = ["", "А", "Б", "В", "Г", "Д", "Е", "Ё", "Ж", "З", "И", "Й", "К", "Л", "М", "Н", "О", "П", "Р", "С", "Т",
               "У", "Ф", "Х", "Ц", "Ч", "Ш", "Щ", "Ъ", "Ы", "Ь", "Э", "Ю", "Я"]

    name = name.upper()
    code = 0
    for letter in name:
        try:
            ltr_code = letters.index(letter) % 9
        except:
            continue
        if ltr_code == 0:
            ltr_code = 9
        code += ltr_code

    while code > 9:
        curr = code // 10 + code % 10
        code = curr

    return code


def what_do_names(mentors):
    all_list = []
    [all_list.extend(x) for x in mentors]
    all_names_list = [x.split(" ")[0].strip() for x in all_list]
    all_names_set = set(all_names_list)
    return all_names_set


def names_codes(all_names_set):
    names_codes = [[] for n in range(10)]
    for name in all_names_set:
        code = calc_namecode(name)
        names_codes[code].append(name)
    return names_codes

def final_out(names_codes):
    for id, _ in enumerate(names_codes):
        if id == 0:
            continue
        print(codes_info[id])
        all_names_sorted = sorted(list(names_codes[id]))
        print(f"Коду {id} соответствуют: {', '.join(all_names_sorted)}")

if __name__ == '__main__':

    assert calc_namecode('Адилет') == 1
    assert calc_namecode('Иван') == 2
    assert calc_namecode('Олег') == 3
    assert calc_namecode('Павел') == 4
    assert calc_namecode('Анна') == 5
    assert calc_namecode('Вадим') == 6
    assert calc_namecode('Максим') == 7
    assert calc_namecode('Юрий') == 8
    assert calc_namecode('Алена') == 9
    assert what_do_names([["Евгений Шмаргунов"], ["Олег Булыгин"], ["Дмитрий Демидов"], ["Кирилл Табельский"]]) == {'Олег', 'Евгений', 'Кирилл', 'Дмитрий'}
    assert names_codes({'Олег', 'Евгений', 'Кирилл', 'Дмитрий'}) == [[], ['Евгений'], [], ['Олег'], ['Кирилл'], [], [], ['Дмитрий'], [], []]
    # a = what_do_names(mentors)
    # b = names_codes(a)
    # c = final_out(b)
    # print(c)